print("я Бот: привет друг как дела")
a=input()
if a=="Хорошо":
    print("Понятно а  как тебя зовут?")
    g=input()
    if g=="Дима":
        print("А меня зовут Даня")
        q=input()
        if q=="что ты такое":
            print("я это ты :) хахахахахахахахха ")
            k=input()
            if k=="блин страшно":
                print("ой я не думал что испугаю тебя прости :) ")
            else:
                print()
    elif g== "Саша":
        print("понятно а меня зовут ИванЗоло2004")
    else:
        print("sonik")
